In [192]:
import pandas as pd

In [193]:
obj = pd.Series(np.arange(4.), index=['a', 'b', 'c', 'd'])

In [194]:
obj

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [195]:
obj['b']

1.0

In [196]:
obj[1]

1.0

In [197]:
obj[2:4]

c    2.0
d    3.0
dtype: float64

In [198]:
obj[['b', 'a', 'd']]

b    1.0
a    0.0
d    3.0
dtype: float64

In [199]:
obj[[1, 3]]

b    1.0
d    3.0
dtype: float64

In [200]:
obj[obj < 2]

a    0.0
b    1.0
dtype: float64

In [201]:
obj['b':'c']

b    1.0
c    2.0
dtype: float64

In [202]:
obj['b':'c'] = 5

In [203]:
obj

a    0.0
b    5.0
c    5.0
d    3.0
dtype: float64

In [204]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
    index=['Ohio', 'Colorado', 'Utah', 'New York'],
    columns=['one', 'two', 'three', 'four'])

In [205]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [206]:
data['two']

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int64

In [207]:
data[['three', 'one']]

          three  one
Ohio          2    0
Colorado      6    4
Utah         10    8
New York     14   12

In [208]:
data[:2]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [209]:
data[data['three'] > 5]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [210]:
data < 5

            one    two  three   four
Ohio       True   True   True   True
Colorado   True  False  False  False
Utah      False  False  False  False
New York  False  False  False  False

In [211]:
data[data < 5] = 0

In [212]:
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15